0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========|                                                                  |
| \\      /  F ield | OpenFOAM: The Open Source CFD Toolbox                   |
|  \\    /   O peration | Version:  11                                        |
|   \\  /    A nd | Website:  www.openfoam.org                                |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1e-6 0 0);

boundaryField
{
    xMin
    {
        type            cyclic;
        neighbourPatch  xMax;
    }
    xMax
    {
        type            cyclic;
        neighbourPatch  xMin;
    }
    yMin
    {
        type            cyclic;
        neighbourPatch  yMax;
    }
    yMax
    {
        type            cyclic;
        neighbourPatch  yMin;
    }
    zMin
    {
        type            cyclic;
        neighbourPatch  zMax;
    }
    zMax
    {
        type            cyclic;
        neighbourPatch  zMin;
    }
    porousInterface
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
