0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========|                                                                  |
| \\      /  F ield | OpenFOAM: The Open Source CFD Toolbox                   |
|  \\    /   O peration | Version:  11                                        |
|   \\  /    A nd | Website:  www.openfoam.org                                |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    xMin
    {
        type            cyclic;
        neighbourPatch  xMax;
    }
    xMax
    {
        type            cyclic;
        neighbourPatch  xMin;
    }
    yMin
    {
        type            cyclic;
        neighbourPatch  yMax;
    }
    yMax
    {
        type            cyclic;
        neighbourPatch  yMin;
    }
    zMin
    {
        type            cyclic;
        neighbourPatch  zMax;
    }
    zMax
    {
        type            cyclic;
        neighbourPatch  zMin;
    }

    porousInterface
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //