constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========|                                                                  |
| \\      /  F ield | OpenFOAM: The Open Source CFD Toolbox                   |
|  \\    /   O peration | Version:  11                                        |
|   \\  /    A nd | Website:  www.openfoam.org                                |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  laminar;

// ************************************************************************* //