system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| ========= |                                                                 |
| \\  /  F ield | OpenFOAM: The Open Source CFD Toolbox                       |
|  \\/ O peration | Version:  11                                                |
|   \\  / A nd | Website:  www.openfoam.org                                   |
|    \\/  M anipulation  |                                                     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 20;

method          simple;

simpleCoeffs
{
    n               (5 2 2);
    delta           0.001;
}

preservePatches (porousInterface);

// ************************************************************************* //
