system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| ========= |                                                                 |
| \\  /  F ield | OpenFOAM: The Open Source CFD Toolbox                       |
|  \\/ O peration | Version:  11                                                |
|   \\  / A nd | Website:  www.openfoam.org                                   |
|    \\/  M anipulation  |                                                     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState; // Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss limitedLinearV 1;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}

// ************************************************************************* //
